Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB176.atdf
      <value-group caption="ADC0 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN0">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC1 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN1">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC2 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN2">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC3 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN3">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC4 Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN4">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Analog and Bias Circuitry Enable bit" name="ADCANCON__ANEN7">
         <value caption="Analog and bias circuitry enabled. Once the analog and bias circuit is enabled" name="" value="0x1" />
         <value caption="Analog and bias circuitry disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 0 Wake-up Status bit" name="ADCANCON__WKRDY0">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 1 Wake-up Status bit" name="ADCANCON__WKRDY1">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 2 Wake-up Status bit" name="ADCANCON__WKRDY2">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 3 Wake-up Status bit" name="ADCANCON__WKRDY3">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 4 Wake-up Status bit" name="ADCANCON__WKRDY4">
         <value caption="ADCx Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANENx to 1" name="" value="0x1" />
         <value caption="ADCx Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Status bit" name="ADCANCON__WKRDY7">
         <value caption="ADC7 Analog and Bias circuitry ready after the wake-up count number 2WKUPEXP clocks after setting ANEN7 to 1" name="" value="0x1" />
         <value caption="ADC7 Analog and Bias circuitry is not ready" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 0 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN0">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 1 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN1">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 2 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN2">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 3 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN3">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="ADC 4 Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN4">
         <value caption="Enable interrupt and generate interrupt when the WKRDYx status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Shared ADC Wake-up Interrupt Enable bit" name="ADCANCON__WKIEN7">
         <value caption="Enable interrupt and generate interrupt when the WKRDY7 status bit is set" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Wake-up Clock Count bits" name="ADCANCON__WKUPCLKCNT">
         <value caption="32" name="" value="0xf" />
         <value caption="64 clocks" name="" value="0x6" />
         <value caption="32 clocks" name="" value="0x5" />
         <value caption="16 clocks" name="" value="0x4" />
         <value caption="16 clocks" name="" value="0x3" />
         <value caption="16 clocks" name="" value="0x2" />
         <value caption="16 clocks" name="" value="0x1" />
         <value caption="16 clocks" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01152" name="CAN" version="1">
      <register-group name="CAN">
         <register caption="CAN Module Control Register" name="C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C1CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C1CON__CANBUSY" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="CAN On bit(1)" mask="0x00008000" name="ON" values="C1CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00010000" name="CANCAP" values="C1CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C1CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C1CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C1CON__ABAT" />
         </register>
         <register caption="CAN Module Control Register" name="C2CON" offset="0x1000" rw="RW" size="4">
            <bitfield caption="Device Net Filter Bit Number bits" mask="0x0000001F" name="DNCNT" values="C2CON__DNCNT" />
            <bitfield caption="CAN Module is Busy bit" mask="0x00000800" name="CANBUSY" values="C2CON__CANBUSY" />
            <bitfield mask="0x00002000" name="SIDL" />
            <bitfield caption="CAN On bit(1)" mask="0x00008000" name="ON" values="C2CON__ON" />
            <bitfield caption="CAN Message Receive Time Stamp Timer Capture Enable bit" mask="0x00010000" name="CANCAP" values="C2CON__CANCAP" />
            <bitfield caption="Operation Mode Status bits" mask="0x00E00000" name="OPMOD" values="C2CON__OPMOD" />
            <bitfield caption="Request Operation Mode bits" mask="0x07000000" name="REQOP" values="C2CON__REQOP" />
            <bitfield caption="Abort All Pending Transmissions bit" mask="0x08000000" name="ABAT" values="C2CON__ABAT" />
         </register>
         <register caption="CAN Baud Rate Configuration Register" name="C1CFG" offset="0x10" rw="RW" size="4">
            <bitfield caption="Baud Rate Prescaler bits" mask="0x0000003F" name="BRP" values="C1CFG__BRP" />
            <bitfield caption="Synchronization Jump Width bits" mask="0x000000C0" name="SJW" values="C1CFG__SJW" />
            <bitfield caption="Propagation Time Segment bits" mask="0x00000700" name="PRSEG" values="C1CFG__PRSEG" />
            <bitfield caption="Phase Buffer Segment 1 bits" mask="0x00003800" name="SEG1PH" values="C1CFG__SEG1PH" />
            <bitfield caption="Sample of the CAN Bus Line bit" mask="0x00004000" name="SAM" values="C1CFG__SAM" />
            <bitfield caption="Phase Segment 2 Time Select bit" mask="0x00008000" name="SEG2PHTS" values="C1CFG__SEG2PHTS" />
            <bitfield caption="Phase Buffer Segment 2 bits" mask="0x00070000" name="SEG2PH" values="C1CFG__SEG2PH" />
            <bitfield caption="CAN Bus Line Filter Enable bit" mask="0x00400000" name="WAKFIL" values="C1CFG__WAKFIL" />
         </register>
