Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/0.1/PIC32MZDA/atdf/PIC32MZ1064DAB176.atdf
         <register caption="USB Indexed Endpoint Control Status Register 1 (Endpoint 1-7)" name="USBIENCSR1" offset="0x14" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="RXMAXP" />
            <bitfield mask="0x0000F800" name="MULT" />
            <bitfield caption="Data Packet Reception Status bit" mask="0x00010000" name="RXPKTRDY" values="USBIENCSR1__RXPKTRDY" />
            <bitfield caption="FIFO Full Status bit" mask="0x00020000" name="FIFOFULL" values="USBIENCSR1__FIFOFULL" />
            <bitfield caption="Data Overrun Status bit" mask="0x00040000" name="ERROR" values="USBIENCSR1__ERROR" />
            <bitfield caption="Data Packet Error Status bit" mask="0x00080000" name="DERRNAKT" values="USBIENCSR1__DERRNAKT" />
            <bitfield caption="Flush FIFO Control bit" mask="0x00100000" name="FLUSH" values="USBIENCSR1__FLUSH" />
            <bitfield caption="STALL Handshake Control bit" mask="0x00200000" name="REQPKT" values="USBIENCSR1__REQPKT" />
            <bitfield caption="STALL Handshake Status bit" mask="0x00400000" name="RXSTALL" values="USBIENCSR1__RXSTALL" />
            <bitfield caption="Clear Data Toggle Control bit" mask="0x00800000" name="CLRDT" values="USBIENCSR1__CLRDT" />
            <bitfield caption="Incomplete Packet Status bit" mask="0x01000000" name="INCOMPRX" values="USBIENCSR1__INCOMPRX" />
            <bitfield mask="0x02000000" name="DATATGGL" />
            <bitfield caption="Data Toggle Write Enable Control bit (" mask="0x04000000" name="DATATWEN" values="USBIENCSR1__DATATWEN" />
            <bitfield caption="DMA Request Mode Selection bit" mask="0x08000000" name="DMAREQMD" values="USBIENCSR1__DMAREQMD" />
            <bitfield caption="Disable NYET Handshakes Control/PID Error Status bit" mask="0x10000000" name="PIDERR" values="USBIENCSR1__PIDERR" />
            <bitfield caption="DMA Request Enable Control bit" mask="0x20000000" name="DMAREQEN" values="USBIENCSR1__DMAREQEN" />
            <bitfield caption="Isochronous Endpoint Control bit" mask="0x40000000" name="AUTORQ" values="USBIENCSR1__AUTORQ" />
            <bitfield caption="RXPKTRDY Automatic Clear Control bit" mask="0x80000000" name="AUTOCLR" values="USBIENCSR1__AUTOCLR" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 2 (Endpoint 0)" name="USBIE0CSR2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="RXCNT" />
            <bitfield caption="Operating Speed Control bits" mask="0x00C00000" name="SPEED" values="USBIE0CSR2__SPEED" />
            <bitfield mask="0x0F000000" name="NAKLIM" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 2 (Endpoint 1-7)" name="USBIENCSR2" offset="0x18" rw="RW" size="4">
            <bitfield mask="0x00003FFF" name="RXCNT" />
            <bitfield mask="0x000F0000" name="TEP" />
            <bitfield caption="TX Endpoint Protocol Control bits" mask="0x00300000" name="PROTOCOL" values="USBIENCSR2__PROTOCOL" />
            <bitfield caption="TX Endpoint Operating Speed Control bits (" mask="0x00C00000" name="SPEED" values="USBIENCSR2__SPEED" />
            <bitfield mask="0xFF000000" name="TXINTERV" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 3 (Endpoint 0)" name="USBIE0CSR3" offset="0x1C" rw="R" size="4">
            <bitfield mask="0x01000000" name="UTMIDWID" />
            <bitfield caption="Soft Connect/Disconnect Option bit" mask="0x02000000" name="SOFTCONE" values="USBIE0CSR3__SOFTCONE" />
            <bitfield caption="Dynamic FIFO Sizing Option bit" mask="0x04000000" name="DYNFIFOS" values="USBIE0CSR3__DYNFIFOS" />
            <bitfield caption="High-bandwidth TX ISO Option bit" mask="0x08000000" name="HBTXEN" values="USBIE0CSR3__HBTXEN" />
            <bitfield caption="High-bandwidth RX ISO Option bit" mask="0x10000000" name="HBRXEN" values="USBIE0CSR3__HBRXEN" />
            <bitfield caption="Byte Ordering Option bit" mask="0x20000000" name="BIGEND" values="USBIE0CSR3__BIGEND" />
            <bitfield caption="Automatic Splitting Option bit" mask="0x40000000" name="MPTXEN" values="USBIE0CSR3__MPTXEN" />
            <bitfield caption="Automatic Amalgamation Option bit" mask="0x80000000" name="MPRXEN" values="USBIE0CSR3__MPRXEN" />
         </register>
         <register caption="USB Indexed Endpoint Control Status Register 3 (Endpoint 1-7)" name="USBIENCSR3" offset="0x1C" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="TEP" />
            <bitfield caption="RX Endpoint Protocol Control bits" mask="0x00000030" name="PROTOCOL" values="USBIENCSR3__PROTOCOL" />
            <bitfield caption="RX Endpoint Operating Speed Control bits" mask="0x000000C0" name="SPEED" values="USBIENCSR3__SPEED" />
            <bitfield mask="0x0000FF00" name="RXINTERV" />
            <bitfield caption="Transmit FIFO Size bits" mask="0x0F000000" name="TXFIFOSZ" values="USBIENCSR3__TXFIFOSZ" />
            <bitfield caption="Receive FIFO Size bits" mask="0xF0000000" name="RXFIFOSZ" values="USBIENCSR3__RXFIFOSZ" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO0" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO1" offset="0x24" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO2" offset="0x28" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO3" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
         <register caption="USB FIFO Data Register x (x = 0-7" name="USBFIFO4" offset="0x30" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="DATA" />
         </register>
